function []=omadiki2h_final() %Edo exei ta erotimata 5-8 tis ergasias
[pref,g,w,EI,L]=diabasmaarxeioy();
proth=pref;
icode=input("Give me the number of the situation that you want to save the plots as jpg file");
filename=strcat(proth,".res");
file_handle = fopen(filename, "w");
fprintf(file_handle, "Το πρόγραμμα δέχεται ως ορίσματα εισόδου το μόνιμο φορτίο J, το κινητό φορτίο Q, το μέτρο ακαμψίας της δοκού καθώς και το μήκος της. Αυτά τα λαμβάνει απο τα αρχεια .dat τα οποία πρέπει να φέρουν τα δεδομένα με την ανωτέρο σειρά, χωρίς να παρεμβάλλονται σχόλια και κενά στις τιμές τους.\nΟ απότερος σκοπός του προγράμματος αποτελεί την επιστροφή στο χρήστη: \n1)των διαγραμμάτων τεμνουσών Q \n2)καμπτικών ροπών Μ \n3)την ελαστική γραμμή της δοκού για τις τρεις περιπτώσεις φορτησης. \nΕπίσης επιστρέφει και αποθηκεύει τις μέγιστες και ελάχιστες τιμές της παραμόρφωσης του φορέα από τις τρεις περιπτώσεις.\nΗ συνάρτηση antidraseis χρησιμοποιεί τις στατικές εξισώσεις ισσοροποίας σε συνδιασμό με τα δεδομένα των αντιδράσεων από την εκφώνηση και υπολογίζει τις υπόλοιπες αντιδράσεις ξεχωριστά για το φορτίο σε κάθε άνοιγμα. Ακολούθως, με την αρχη της επαλληλίας οι τιμές των αντιδράσεων αυτές, τρεις για κάθε αντίδραση δηλαδή, αθροίζονται ώστε να προκύψουν οι τελικές αντιδράσεις σε όλο το μήκος της δοκού για το κατανεμημένο φορτίο. Στη συνέχεια υπολογίζονται οι συνολικές αντιδράσεις ανάλογα με τη περίπτωση φόρτισης, προσθέτοντας κάθε φορά στις τελικές αντιδράσεις για το μόνιμο φορτίο τις αντιδράσεις που προκαλεί το κινητό (είναι ανάλογες με τις επιμέρους αντιδράσεις που βρήκαμε πριν την αρχή της επαλληλίας). Τελικά οι αντιδράσεις χρησιμοποιούνται ως φορτία στις συναρτήσεις anoigma & elastiki και αποθηκεύονται τα αποτελέσματα του.\nΤο πρόθεμα των αρχείων ορίζεται από τον χρήστη με την έναρξη του προγράμματος χρησιμοποιώντας τη συνάρτηση διάβασμα αρχείου η οποία επιστρέφει σφάλμα σε περίπτωση αδυναμίας έυρεσης κάποιου αντίστοιχου προθέματος. Επιπρόσθετα, περιέχει τη συνάρτηση get label reals η οποία εξασφαλίζει την αρτιότητα των δεδομένων δηλαδή οι τιμές που δέχονται τα φορτία να ειναι οποιοσδήποτε πραγματικός αριθμός ενώ το μήκος και η ακαμψία να είναι οποιοσδήποτε θετικός και μη μηδενικώς αριθμός, η μη τήρηση των παραπάνω επιστρέφει ως σφάλμα στον χρήστη. Παράλληλα κατά την ανάγνωση των αρχείων με τη χρηση της del comments, εντοπίζει και διαγράφει τυχόν σχόλια. Τα δεδομένα αρχικά χρησιμοποιούνται στη συνάρτηση αντιδρασεις η οποία με τα δεδομένα αντιδράσεων από την εκφώνηση και με τη χρήση της αρχής της επαλληλίας επιλύει τα συστήματα αντιδράσεων και ανάλογα με τη περίπτωση φόρτισης επιστρέφει τις αντίστοιχες τιμές. Οι τιμές αυτές χρησιμοποιούνται από τη συνάρτηση άνοιγμα οι οποία με δεδομένα εισόδου τα φορτία του κάθε τμήματος (είτε αυτές ειναι αντιδράσεις είτε αυτές ειναι φορτία) καθώς και το μήκος L του κάθε τμήματος, τις ροπές στα αριστερά άκρα του κάθε τμήματος, τις τιμές των φορτίων. Η συνάρτηση άνοιγμα συντάσσεται τέτοια ώστε να δέχεται τις τιμές q του κινητού φορτίου, μηδενίζοντας τη τιμή του, οπου αυτό δεν υπάρχει. Επιστρέφει τις τιμές των Μ, Q, x για το κάθε άνοιγμα υπό τη συγκεκριμένη φόρτιση. Στη συνέχεια οι τιμές αυτές περιέχονται σε κοινό διάνυσμα, καθώς πρέπει να εκπονείται ένα συνεχές γράφημα των τιμών αυτών κατα μήκος της δοκού και όχι κατα τμήμα αυτής.\nΓια την εύρεση της ελαστικής γραμμής χρησιμοποιείται η συνάρτηση elastiki η οποία με διπλή αριθμητική ολοκλήρωση των τριών ροπών, επιστρέφει την εξίσωση της ελαστικής γραμμής σε όλο το μήκος της δοκού. Δέχεται για ορίσματα εισόδου τις τιμές της καμπτικής ροπής το μήκος του ανοίγματος και επιστρέφει την παραμόρφωση του φορέα.\nΤα αποτελέσματα των συναρτήσεων anoigma, elastiki παρουσιάζονται σε ξεχωριστά γραφήματα για την κάθε περίπτωση φόρτισης και σε κάθε γράφημα περιέχονται τρία υπογραφήματα το ένα κάτω απο το άλλο των Q,M,Y αντίστοιχα. Αυτά επιστρέφονται στον χρήστη και αποθηκεύονται σε μορφή .jpg μόνο αυτά για την περίπτωση φόρτησης που θα επιλέξει.");
fclose(file_handle);
filename="";
%qaristerh
q1=0.35.*g+1.5.*w;
q2=0;
q3=0;
[R1ola,R2ola,R3ola,R4ola]=antidraseis(q1,q2,q3,L,g);
[M1,Q1,x1]=anoigma(R1ola,q1,g,L,0);
[M2,Q2,x2]=anoigma(R2ola+Q1(100),q2,g,L,M1(end));
[M3,Q3,x3]=anoigma(R3ola+Q2(100),q3,g,L,M2(end));
x=[x1,x2+L,x3+L+L];
Q11=[Q1,Q2,Q3];
M=[M1,M2,M3];
figure(1)
subplot(3,1,1)
plot(x,Q11)
title('ΔΙΑΓΡΑΜΜΑ ΤΕΜΝΟΥΣΩΝ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('TΙΜΕΣ ΤΕΜΝΟΥΣΑΣ')
legend('y=Q(x)')
grid on
subplot(3,1,2)
plot(x,M)
title('ΔΙΑΓΡΑΜΜΑ ΚΑΜΠΤΙΚΗΣ ΡΟΠΗΣ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('TΙΜΕΣ ΚΑΜΠΤΙΚΗΣ ΡΟΠΗΣ')
legend('y=M(x)')
grid on
[ELT,x]=elastiki_1(Q1,Q2,M1,M2,q1,q2,q3,g,R1ola,R2ola,R3ola,EI,L);
k1=ELT;
k=ELT;
subplot(3,1,3)
plot(x,ELT)
title('ΕΛΑΣΤΙΚΗ ΓΡΑΜΜΗ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('ΠΑΡΑΜΟΡΦΩΣΗ')
legend('y=EIy(x)')
grid on
if icode==1
  a=proth;
  b="_";
  c=strcat(a,b);
  d=num2str(icode);
  filename=strcat(c,d);
  print("-djpeg", filename);
endif
counter=1;
for i=length(k):-1:1
  ELT(counter)=k(i);
  counter=counter+1;
endfor
k=ELT;
k3=k;
%%%
%q mesh
q1=0;
q2=0.35.*g+1.5.*w;
q3=0;
[R1ola,R2ola,R3ola]=antidraseis(q1,q2,q3,L,g);
[M1,Q1,x1]=anoigma(R1ola,q1,g,L,0);
[M2,Q2,x2]=anoigma(R2ola+Q1(100),q2,g,L,M1(100));
[M3,Q3,x3]=anoigma(R3ola+Q2(100),q3,g,L,M2(100));
x=[x1,x2+L,x3+L+L];
Q12=[Q1,Q2,Q3];
M=[M1,M2,M3];
%%%
figure(2)
grid on;
subplot(3,1,1)
plot(x,Q12)
title('ΔΙΑΓΡΑΜΜΑ ΤΕΜΝΟΥΣΩΝ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('TΙΜΕΣ ΤΕΜΝΟΥΣΑΣ')
legend('y=Q(x)')
grid on
subplot(3,1,2)
plot(x,M)
title('ΔΙΑΓΡΑΜΜΑ ΚΑΜΠΤΙΚΗΣ ΡΟΠΗΣ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('TΙΜΕΣ ΚΑΜΠΤΙΚΗΣ ΡΟΠΗΣ')
legend('y=M(x)')
grid on
[ELT,x]=elastiki_1(Q1,Q2,M1,M2,q1,q2,q3,g,R1ola,R2ola,R3ola,EI,L);
subplot(3,1,3)
plot(x,ELT)
title('ΕΛΑΣΤΙΚΗ ΓΡΑΜΜΗ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('ΠΑΡΑΜΟΡΦΩΣΗ')
legend('y=EIy(x)')
grid on
k2=ELT;
if icode==2
  a=proth;
  b="_";
  c=strcat(a,b);
  d=num2str(icode);
  filename=strcat(c,d);
  print("-djpeg", filename);
endif
%%%%%
%q dexia
q3=0.35.*g+1.5.*w;
q2=0;
q1=0;
[R1ola,R2ola,R3ola]=antidraseis(q1,q2,q3,L,g);
%mqn
[M1,Q1,x1]=anoigma(R1ola,q1,g,L,0);
[M2,Q2,x2]=anoigma(R2ola+Q1(100),q2,g,L,M1(100));
[M3,Q3,x3]=anoigma(R3ola+Q2(100),q3,g,L,M2(100));
x=[x1,x2+L,x3+L+L];
Q13=[Q1,Q2,Q3];
M=[M1,M2,M3];
figure(3)
grid on;
subplot(3,1,1)
plot(x,Q13)
title('ΔΙΑΓΡΑΜΜΑ ΤΕΜΝΟΥΣΩΝ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('TΙΜΕΣ ΤΕΜΝΟΥΣΑΣ')
legend('y=Q(x)')
grid on
subplot(3,1,2)
plot(x,M)
title('ΔΙΑΓΡΑΜΜΑ ΚΑΜΠΤΙΚΗΣ ΡΟΠΗΣ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('TΙΜΕΣ ΚΑΜΠΤΙΚΗΣ ΡΟΠΗΣ')
legend('y=M(x)')
grid on
subplot(3,1,3)
plot(x,k)
title('ΕΛΑΣΤΙΚΗ ΓΡΑΜΜΗ')
xlabel('ΜΗΚΟΣ ΔΟΚΟΥ 0<x<3L')
ylabel('ΠΑΡΑΜΟΡΦΩΣΗ')
legend('y=EIy(x)')
grid on
if icode==3
  a=proth;
  b="_";
  c=strcat(a,b);
  d=num2str(icode);
  filename=strcat(c,d);
  print("-djpeg", filename);
endif
Qper=[Q11;Q12;Q13];
disp("Exoume oti ta megista thetika einai:")
Emax=max(k1)
Emax=max(k2)
Emax=max(k3)
disp("Exoume oti ta megista arnitika einai:")
Emin=min(k1)
Emin=min(k2)
Emin=min(k3)
end
